Public Attributes | List of all members
API_UserInfo Struct Reference
Project Operations
Information on a registered Team Member. More...
#include <APIdefs_Environment.h>
 Public Attributes
GS::uchar_t  | loginName [API_UniLongNameLen]
Unique member login name as Unicode string.
GS::uchar_t  | fullName [API_UniLongNameLen]
API_Guid  | guid
member full name as Unicode string
short  | userId
member ID
bool  | connected
actually connected to the teamwork project or not
Detailed Description
Information on a registered Team Member.
Remarks
Refer to the ACAPI_Teamwork_ProjectSharing function for more details.
Member Data Documentation
◆ connected
 API_UserInfo::connected
actually connected to the teamwork project or not
◆ fullName
 GS::uchar_t API_UserInfo::fullName[API_UniLongNameLen]
◆ guid
 API_UserInfo::guid
member full name as Unicode string
member identifier
◆ loginName
 API_UserInfo::loginName
Unique member login name as Unicode string.
◆ userId
 API_UserInfo::userId
member ID